app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "articles" SET "updated_at" = ?, "status" = ? WHERE "articles"."id" = ?  [["updated_at", "2021-12-06 19:09:55.241337"], ["status", "Public"], ["id", 5]]
---
  def update
    @article = Article.find(params[:id])

    if @article.update(article_params)